
//     Задача Descending Order
//  Написать функцию, которая может принимать любое неотрицательное
//  целое число в качестве аргумента и возвращать его с цифрами в
//  порядке убывания.


let a;
function descendingOrder(n){
    a = +(String(n).split('').sort((a,b)=> b-a).join(''))
   return a
}

descendingOrder(123456789)
console.log(a)
///////////////////////////////////////////////////////////////////////////////////////////

    // Четное не четное
// Учитывая список целых чисел, определите, является 
// ли сумма его элементов нечетному или четному.
// Дайте свой ответ в виде строки, соответствующей
//  «odd» или «even».

function oddOrEven(arr) {
    return arr.reduce((a,b)=>a+b,0) % 2 ? 'odd' : 'even';
  }

  console.log(oddOrEven([1,3,7,1]))
///////////////////////////////////////////////////////////////////////////////////////////////

//   Для строки, состоящей из букв a, b и / или c, поменяйте 
//   положение букв a и b (измените a на b и наоборот).
//    Не трогайте любые случаи c.
//   Пример:
//   'acb' --> 'bca'
//   'aabacbaa' --> 'bbabcabb'

function switcheroo(x){
    return x.split('').
    map(item => {
      if(item == 'b') return 'a';
      if(item == 'a') return 'b';
      if(item == 'c') return 'c';
    }).join('');
  }
  console.log(switcheroo('aaabcccbaaa'))
  ////////////////////////////////////////////////////////////////////////////////////////////

//   Задача FizzBuzz	
//   Требуется написать функцию, выводящую в консоль числа от 1 до n, где n — это целое число, 	  
//   которое функция принимает в качестве параметра, с такими условиями:	            
//   вывод fizz вместо чисел, кратных 3;	  
//   вывод buzz вместо чисел, кратных 5;	
//   вывод fizzbuzz вместо чисел, кратных как 3, так и 5.

const fizzBuzz = num => {	
    for(let i = 1; i < num; i++) {	
        if(i % 3 === 0 && i % 5 === 0) {	    
            console.log('fizzbuzz')	  
        }	
        else if(i % 3 === 0) {	
            console.log('fizz')	
        } 	
        else if(i % 5 === 0) {	
            console.log('buzz')	
        } else {	
            console.log(i)	
        }	
    }	
}	
fizzBuzz(14)
//////////////////////////////////////////////////////////////////////////////////////////////////